from collections import UserString

template = [
    "Вы можете достичь всего. Стоит только немного постараться и запастись книгами.",
    "Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете.",
    "Собрать камни бесконечности легко, если вы прирожденный герой.",
    "Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике.",
    "Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами.",
    "Программировать не настолько сложно, как об этом говорят.",
    "Простые ежедневные упражнения помогут достичь успеха."
]
