# Написать функцию, которая определяет какой день недели у определенной даты в виде "день-месяц-год".

from datetime import datetime

days_name = {
    0: "понедельник",
    1: "вторник",
    2: "среда",
    3: "четверг",
    4: "пятница",
    5: "суббота",
    6: "воскресенье",
}


def day_of_week(date):

    return None


print(day_of_week('26-01-2022'))
print(day_of_week('24-02-2022'))
print(day_of_week('13-05-2022'))
