"""
Реализовать функцию, которая возвращает n наиболее часто встречающихся и n наименее часто встречающихся чисел из файла
"""

from collections import Counter

filename = 'numbers.txt'


def num_counter(filename, n):

    return None


result = num_counter(filename, 10)

print(result)
