"""
Есть список 2 списка телефонов: первый - список всех регистраций, второй - тех, кто подключились к игре.
Определить список телефонов тех, кто зарегистрировался, но не начал работу на сайте.
["380669640547", "0637306465",
"380961935171", "632643973", "508325200", "000000000", "48730283918", "986223575", "375297947963"]

["380669640547", "0637306465" "632643973", "508325200", "48730283918", "986223575"]
"""

from ex_08 import isvalid_phone

registration = ["380669640547", "0637306465",
                "380961935171", "632643973", "508325200", "000000000", "48730283918", "986223575", "375297947963"]
connect = ["380669640547", "0637306465" "632643973",
           "508325200", "48730283918", "986223575"]

valid_registration = []
for phone in registration:
    if isvalid_phone(phone):
        valid_registration.append(phone)


valid_connect = []
for phone in connect:
    if isvalid_phone(phone):
        valid_connect.append(phone)

result = list(set(valid_registration) & set(valid_connect))
print(f"Результат: {result}")
